1、八进制必须以__0___开头，十六进制必须以___0x____开头。

2、标识符只能由____数字___、___字母____和___下划线____组成。

3、在计算机中的进制表现形式有三种，分别是__10进制___、 ___8进制____、 ___16进制_____。

4、C 语言提供了 sizeof 运算符，该运算符主要用于____计算变量的大小____。

5、二进制和八进制相互转换
111 010 101 011 转换为八进制后结果为？	7253	
76321 转换为二进制结果为？	10010101000100001


6、二进制和十六进制相互转换
1111 1010 1101 1011 转换为十六进制后结果为？   0xFADB
a6b2f1 转换为二进制结果为？	1010 0110 1011 0010 1111 0001

7、请写出-8的原码、反码、补码          
以int类型为例  
原码:1000 1000 
反码：1111 0111
补码：1111 1000


8、可以使用计算器计算
short a = 0xfffe;
printf("%d\n", a); //结果为多少？
-2     

unsigned short a = 0xfffe;
printf("%u\n", a); //结果为多少？
65534

short a = 0x7fff + 2;
printf("%d\n", a); //结果为多少？
-32767

unsigned short a = 0xffff + 5;
printf("%u\n", a); //结果为多少？
4  